app/views/customers/index.html.erb

SELECT "carts".* FROM "carts" WHERE "carts"."customer_id" = 9 ORDER BY "carts"."id" DESC LIMIT 1
SELECT COUNT(*) FROM "carts" WHERE "carts"."customer_id" = 9
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", 65]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = 219 ORDER BY "line_items"."id" DESC LIMIT 1
SELECT COUNT(*) FROM "line_items" WHERE "line_items"."cart_id" = 66
---
    <th>Street</th>
    <th>Carts.count | </th>
    <th>customer.carts.find(:last).line_items.count</th>