app/views/carts/new.html.erb

  </tr>
  <% @current_cart.line_items.each do |line_item| %>
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = 5

    </tr>
    <%= @current_cart.line_items.count %>
---
SELECT COUNT(*) FROM "line_items" WHERE "line_items"."cart_id" = 66