app/controllers/carts_controller.rb

SELECT "products".* FROM "products"
---
  def new
  	@products = Product.all

SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "carts" ("created_at", "customer_id", "purchased_at", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 05 Jun 2013 13:04:44 UTC +00:00], ["customer_id", nil], ["purchased_at", nil], ["updated_at", Wed, 05 Jun 2013 13:04:44 UTC +00:00]]
---
  def create
    @customer = Customer.find(params[:customer_id])
  	@cart = @customer.carts.build(params[:cart])
  	if @cart.save

SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", "6"]]
SELECT "carts".* FROM "carts" WHERE "carts"."customer_id" = 6 AND "carts"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."customer_id" = 7 AND "line_items"."id" = ? LIMIT 1  [["id", "2"]]
---
  def show
    @customer = Customer.find(params[:customer_id])
    @cart = @customer.carts.find(params[:id])
    @line_items = @customer.line_items.find(params[:id])