app/controllers/customers_controller.rb

SELECT "customers".* FROM "customers"
SELECT "carts".* FROM "carts" WHERE "carts"."customer_id" = 9 ORDER BY "carts"."id" DESC LIMIT 1
---
  def index
    @customers = Customer.all

    respond_to do |format|
      format.html # index.html.erb
      format.json { render json: @customers }
    end
    @penultimate = Cart.all

SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @customer = Customer.find(params[:id])

INSERT INTO "customers" ("created_at", "name", "street", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 02 Jun 2013 07:31:00 UTC +00:00], ["name", "Javier"], ["street", "calle"], ["updated_at", Sun, 02 Jun 2013 07:31:00 UTC +00:00]]
---
  def create
    @customer = Customer.new(params[:customer])

    respond_to do |format|
      if @customer.save

SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "customers" WHERE "customers"."id" = ?  [["id", 4]]
---
  def destroy
    @customer = Customer.find(params[:id])
    @customer.destroy