app/controllers/line_items_controller.rb

	def create
	  #@cart = Cart.find(params[:cart_id])
    @customer = Customer.find(params[:customer_id])
		@product = Product.find(params[:product_id])
    	if LineItem.exists?(:cart_id => current_cart.id, :product_id => @product.id, :customer_id => @customer.id)
      		item = LineItem.find(:first, :conditions => [ "cart_id = #{current_cart.id} AND product_id = #{@product.id} AND customer_id = #{@customer.id}" ])
      		LineItem.update(item.id, :quantity => item.quantity + 1)
    	else
        @line_item = current_cart.line_items.create!(:cart => current_cart, :product => @product, :customer => @customer, :quantity => 1, :unit_price => @product.price)
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", "9"]]
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "line_items".* FROM "line_items" WHERE (cart_id = 224 AND product_id = 3 AND customer_id = 10) LIMIT 1
SELECT 1 AS one FROM "line_items" WHERE "line_items"."cart_id" = 222 AND "line_items"."product_id" = 3 AND "line_items"."customer_id" = 9 LIMIT 1
UPDATE "line_items" SET "quantity" = 2, "updated_at" = '2013-06-05 12:38:49.663424' WHERE "line_items"."id" = 1
INSERT INTO "carts" ("created_at", "customer_id", "purchased_at", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 02 Jun 2013 08:43:19 UTC +00:00], ["customer_id", nil], ["purchased_at", nil], ["updated_at", Sun, 02 Jun 2013 08:43:19 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "customer_id", "product_id", "quantity", "unit_price", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)